Revit 2027 API
ElementId.Parse Method
 Parse the string representation of the id into a corresponding ElementId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId Parse(
	string idStr
)
Public Shared Function Parse (
	idStr As String
) As ElementId
public:
static ElementId^ Parse(
	String^ idStr
)
static member Parse :
        idStr : string -> ElementId
Parameters
idStr String
The string representation of the id to return.
Return Value
ElementId
ElementId string represented.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the string cannot be parsed into an ElementId.
Remarks
 If the string represents [!:Autodesk::Revit::DB::Element::InvalidElementId] it will be returned.
See Also
Reference
ElementId Class
Autodesk.Revit.DB Namespace